spcalendarpro.min.js

/*
* @name SPCalendarPro
* Version 2018.04
* No dependencies!
* @description An ultra lightweight JavaScript library to easily manage SharePoint calendar events.
* @category Plugins/SPCalendarPro
* @author Sam Perrow sam.perrow399@gmail.com
*
* Copyright 2018  Sam Perrow  (email : sam.perrow399@gmail.com)
* Licensed under the MIT license:
* http://www.opensource.org/licenses/mit-license.php
*/

!function(e,t){e.spcalpro=function(){function e(e,t){return{begin:{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString()},end:{endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}}r.prototype.isSameDate=function(){var e=this.userDateTimes.begin.beginDate,t=this.userDateTimes.end.endDate;return this.listData=this.listData.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},r.prototype.matchDateTimes=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.listData=this.listData.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},r.prototype.isTimeConflict=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.listData=this.listData.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}),this},r.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(r+" ")[1],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.listData=this.listData.filter(function(e){return a[r](e[t],n)}),this};var t=function(e,t,r,n){var a,i,s=void 0===t.async||t.async,u="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",o="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",l="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>",c="2010"===n.year?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query>":"<query><Query><Where><IsNull><FieldRef Name='fRecurrence'/></IsNull></Where></Query></query>",d="",m=t.fields?function(){for(var e='<FieldRef Name="fRecurrence"/>',r=0;r<t.fields.length;r++)e+="<FieldRef Name='"+t.fields[r]+"'/>";return e}():"";function p(n){return 4==n.readyState&&200==n.status?(e.listData=function(e){for(var n=[],a=0;a<e.length;a++){var i={},s=e[a].attributes;if("z:row"===e[a].nodeName){for(var u=0;u<s.length;u++){var o=s[u].name.split("ows_")[1];i[o]="EventDate"===o||"EndDate"===o?new Date(s[u].value.replace("-","/")):s[u].value}"calendar"===r&&t.getEventsAfterDate?i.EventDate>=t.getEventsAfterDate&&n.push(i):"calendar"===r&&t.getEventsBeforeDate?i.EndDate<=t.getEventsBeforeDate&&n.push(i):n.push(i)}}return n}(n.responseXML.querySelectorAll("*")),t.callback?t.callback(e):e):500==n.status?e.error={errorCode:n.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0],errorString:n.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0],faultString:n.responseText.split("<faultstring>")[1].split("</faultstring>")[0]}:void 0}return"calendar"===r?(d="single"===t.type?c:"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>":"<query><Query><Where>"+o+l,d+="<viewFields><ViewFields>"+m+"</ViewFields></viewFields></GetListItems>"):"list"===r&&(d="<viewFields><ViewFields>"+m+"</ViewFields></viewFields></GetListItems>"),a=u+d+"</soap:Body></soap:Envelope>",(i=new XMLHttpRequest).open("POST",n.soapURL,s),i.setRequestHeader("X-Requested-With","XMLHttpRequest"),i.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),i.send(a),!0===s?i.onload=function(){return p(i)}:p(i),e.listData};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};function r(e,r){this.listName=e.listName,this.getEventsTodayAndAfter=e.getEventsTodayAndAfter?e.getEventsTodayAndAfter:null,this.getEventsAfterDate=e.getEventsAfterDate?e.getEventsAfterDate:null,this.getEventsBeforeDate=e.getEventsBeforeDate?e.getEventsBeforeDate:null,this.fields=e.fields?e.fields:null,this.userDateTimes=e.userDateTimes?e.userDateTimes:null;var n,a,i=(n=e.sourceSite,{year:15===(a=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:"string"==typeof n&&n.length>0?n+"/_vti_bin/Lists.asmx":15===a?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"});return this.callback=function(){return e.callback?e.callback(this):null},this.listData=t(this,e,r,i),this}return{getCalendarEvents:function(e){return new r(e,"calendar")},getListItems:function(e){return new r(e,"list")},getDateTimesFromForm:function(t,r){var n=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}}(t,r);return e(n.userBeginDT,n.userEndDT)},provideDateTimes:function(t,r){return e(t,r)},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);